cpp_meta.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-06-14 Wed 17:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>C++ Template Metaprogramming</title>
<meta name="author" content="scturtle" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">C++ Template Metaprogramming</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgacadd0a">1. decltype 和 std::declval (C++11)</a></li>
<li><a href="#orga63d402">2. type trait</a></li>
<li><a href="#org9d15870">3. integral_constant</a></li>
<li><a href="#orge5c8fb4">4. type trait 实现的例子</a></li>
<li><a href="#org562a13f">5. function overload resolution</a></li>
<li><a href="#orgf7cf5f9">6. 模板形参包和递归</a></li>
<li><a href="#orged888f4">7. fibnacci 的四种写法</a></li>
<li><a href="#org2d37781">8. SFINAE</a></li>
<li><a href="#org71285dd">9. enable_if</a></li>
<li><a href="#org530b90e">10. integer_sequence (C++14)</a></li>
<li><a href="#org85aba64">11. void_t (C++17)</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgacadd0a" class="outline-2">
<h2 id="orgacadd0a"><span class="section-number-2">1.</span> decltype 和 std::declval (C++11)</h2>
<div class="outline-text-2" id="text-1">
<p>
sizeof, typeid, decltype, noexcept 里的表达式都不会真正生成代码。
</p>

<p>
<code>std::declval</code> 用于在 decltype 里获得一个 <b><b>不一定能实例化</b></b> 的类的成员变量的类型或成员函数的返回类型。
</p>

<div class="org-src-container">
<pre class="src src-c++">struct A {
    A() = delete;
    int foo();
};
decltype(std::declval&lt;A&gt;().foo()) foo = 1;
</pre>
</div>

<p>
其实现只有一个声明，在返回类型中添加了右值引用，结合 decltype 就可以绕过构造函数：
</p>
<div class="org-src-container">
<pre class="src src-c++">template&lt;class T&gt;
typename std::add_rvalue_reference&lt;T&gt;::type declval() noexcept;
</pre>
</div>

<p>
为什么是右值引用？因为可以进行<a href="https://zh.cppreference.com/w/cpp/language/reference">引用折叠</a>，不会改变引用类型，来调用正确的成员函数。
</p>
</div>
</div>


<div id="outline-container-orga63d402" class="outline-2">
<h2 id="orga63d402"><span class="section-number-2">2.</span> type trait</h2>
<div class="outline-text-2" id="text-2">
<p>
元编程的大量脚手架都在 <a href="https://zh.cppreference.com/w/cpp/meta">&lt;type_traits&gt;</a> 。
</p>

<p>
<b><b>type trait</b></b> 是一个 templated struct，其成员变量 <code>value</code> 和/或 关联类型 <code>type</code>
提供了被实例化时的模版形参的信息。
</p>

<p>
这个 templated struct 可以看成 metafunction，
其参数是模版实例化时的实参， <code>value</code> 和/或 <code>type</code> 是返回值。
</p>

<p>
对名为 <code>XXX</code> 的 struct 的 <code>value</code> / <code>type</code> ，通常有对应的 alias 为 <code>XXX_v</code> / <code>XXX_t</code> 。
</p>

<p>
Ref: <a href="https://www.youtube.com/watch?v=tiAVWcjIF6o">https://www.youtube.com/watch?v=tiAVWcjIF6o</a>
</p>
</div>
</div>


<div id="outline-container-org9d15870" class="outline-2">
<h2 id="org9d15870"><span class="section-number-2">3.</span> integral_constant</h2>
<div class="outline-text-2" id="text-3">
<p>
最常用的是 <code>integral_constant</code> 和其特化 <code>bool_constant</code>:
</p>

<div class="org-src-container">
<pre class="src src-c++">template &lt;typename T, T v&gt;
struct integral_constant {
    static constexpr T value = v;
    using type = integral_constant&lt;T, v&gt;;
    // convert to T by calling T(obj)
    constexpr   operator T () const noexcept { return value; }
    // convert to T by obj()
    constexpr T operator ()() const noexcept { return value; }
};

template &lt;bool B&gt;
using bool_constant = integral_constant&lt;bool, B&gt;;
using true_type = bool_constant&lt;true&gt;;
using false_type = bool_constant&lt;false&gt;;

static_assert(true_type::value);
static_assert(true_type{}); // call bool(obj)
static_assert(true_type{}());
</pre>
</div>

<p>
注意 const 的位置， <code>remove_const</code> 只清除最顶层的 <code>const</code>:
</p>
<div class="org-src-container">
<pre class="src src-c++">static_assert(std::is_same_v&lt;const int *, int const *&gt;);
static_assert(std::is_same_v&lt;int *, std::remove_const_t&lt;int * const&gt;&gt;);
</pre>
</div>

<p>
C++ 一共有 14 种基础类型。 <code>&lt;type_traits&gt;</code> 定义了 14 中分类元函数。
返回 true_type 或 false_type，对任意类型 T 有且只有 14 个中的 1 个为 true_type。
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">is_void</td>
<td class="org-left">is_class</td>
</tr>

<tr>
<td class="org-left">is_null_pointer</td>
<td class="org-left">is_function</td>
</tr>

<tr>
<td class="org-left">is_integral</td>
<td class="org-left">is_pointer</td>
</tr>

<tr>
<td class="org-left">is_floating_point</td>
<td class="org-left">is_lvalue_reference</td>
</tr>

<tr>
<td class="org-left">is_array</td>
<td class="org-left">is_rvalue_reference</td>
</tr>

<tr>
<td class="org-left">is_enum</td>
<td class="org-left">is_member_object_pointer</td>
</tr>

<tr>
<td class="org-left">is_union</td>
<td class="org-left">is_member_function_pointer</td>
</tr>
</tbody>
</table>

<p>
其他常用函数：
</p>

<p>
类型属性： <code>is_const</code>, <code>is_trivially_copyable</code>, &#x2026;
支持操作： <code>is_constructible</code>, <code>is_move_assignable</code>, &#x2026;
类型关系： <code>is_same</code>, <code>is_base_of</code>, &#x2026;
类型修改： <code>remove_const</code>, <code>remove_cv</code>, <code>remove_reference</code>, <code>remove_cvref</code>, <code>remove_pointer</code>,
           <code>add_lvalue_reference</code>, <code>add_rvalue_reference</code>&#x2026;
</p>
</div>
</div>


<div id="outline-container-orge5c8fb4" class="outline-2">
<h2 id="orge5c8fb4"><span class="section-number-2">4.</span> type trait 实现的例子</h2>
<div class="outline-text-2" id="text-4">
<p>
<code>is_void</code>:
</p>
<div class="org-src-container">
<pre class="src src-c++">template &lt;typename T&gt;
struct is_void : std::false_type {};
template &lt;&gt;
struct is_void&lt;void&gt; : std::true_type {};
</pre>
</div>

<p>
<code>conditional</code>:
</p>
<div class="org-src-container">
<pre class="src src-c++">template&lt;bool B, class T, class F&gt;
struct conditional { using type = T; };
template&lt;class T, class F&gt;
struct conditional&lt;false, T, F&gt; { using type = F; };
</pre>
</div>
</div>
</div>


<div id="outline-container-org562a13f" class="outline-2">
<h2 id="org562a13f"><span class="section-number-2">5.</span> function overload resolution</h2>
<div class="outline-text-2" id="text-5">
<p>
<a href="https://abseil.io/tips/148">https://abseil.io/tips/148</a>
<a href="https://zh.cppreference.com/w/cpp/language/overload_resolution">https://zh.cppreference.com/w/cpp/language/overload_resolution</a>
</p>

<p>
Overload set 规则:
</p>
<ul class="org-ul">
<li>形参数量可以不同</li>
<li>返回类型可以不同，但形参不能相同</li>
</ul>

<p>
用参数类型来静态分发：
</p>
<div class="org-src-container">
<pre class="src src-c++">void func(true_type) { std::cout &lt;&lt; "true" &lt;&lt; std::endl; }
void func(false_type) { std::cout &lt;&lt; "false" &lt;&lt; std::endl; }
func(integral_constant&lt;bool, 1 == 2&gt;{});
</pre>
</div>

<p>
实现 type trait：
</p>
<div class="org-src-container">
<pre class="src src-c++">std::true_type is_nullptr_impl(std::nullptr_t);
std::false_type is_nullptr_impl(...);
template &lt;typename T&gt;
using is_nullptr = decltype(is_nullptr_impl(std::declval&lt;T&gt;()));
</pre>
</div>
</div>
</div>


<div id="outline-container-orgf7cf5f9" class="outline-2">
<h2 id="orgf7cf5f9"><span class="section-number-2">6.</span> 模板形参包和递归</h2>
<div class="outline-text-2" id="text-6">
<p>
<a href="https://zh.cppreference.com/w/cpp/language/parameter_pack">https://zh.cppreference.com/w/cpp/language/parameter_pack</a>
</p>

<div class="org-src-container">
<pre class="src src-c++">template &lt;typename T, typename ...Ts&gt;
struct is_type_in_pack : std::false_type {};

template &lt;typename T, typename ...Ts&gt;
struct is_type_in_pack&lt;T, T, Ts...&gt; : std::true_type {};

template &lt;typename T, typename T0, typename ...Ts&gt;
struct is_type_in_pack&lt;T, T0, Ts...&gt;: is_type_in_pack&lt;T, Ts...&gt; {};
</pre>
</div>
</div>
</div>


<div id="outline-container-orged888f4" class="outline-2">
<h2 id="orged888f4"><span class="section-number-2">7.</span> fibnacci 的四种写法</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-c++">template&lt;int n&gt;
struct Fibnacci {
    static constexpr int value = Fibnacci&lt;n - 1&gt;::value + Fibnacci&lt;n - 2&gt;::value;
};
template &lt;&gt; struct Fibnacci&lt;1&gt; { static constexpr int value = 1; };
template &lt;&gt; struct Fibnacci&lt;0&gt; { static constexpr int value = 0; };
</pre>
</div>

<p>
使用 <code>integral_constant</code> ：
</p>
<div class="org-src-container">
<pre class="src src-c++">template&lt;int n&gt;
struct Fibnacci: std::integral_constant&lt;int, Fibnacci&lt;n - 1&gt;::value + Fibnacci&lt;n - 2&gt;::value&gt; {};
template&lt;&gt; struct Fibnacci&lt;0&gt;: std::integral_constant&lt;int, 0&gt; {};
template&lt;&gt; struct Fibnacci&lt;1&gt;: std::integral_constant&lt;int, 1&gt; {};
</pre>
</div>

<p>
使用 C++17 的 <code>if constexpr</code> ：
</p>
<div class="org-src-container">
<pre class="src src-c++">template&lt;int n&gt;
struct Fibnacci {
    static constexpr int value = []() {
        if constexpr (n &gt; 1)
            return Fibnacci&lt;n - 1&gt;::value + Fibnacci&lt;n - 2&gt;::value;
        return n;
    }();
};
</pre>
</div>

<p>
使用 constexpr function （template instantiation is **memorized**）:
</p>
<div class="org-src-container">
<pre class="src src-c++">template&lt;int n&gt;
constexpr auto Fibnacci() {
    if constexpr (n &gt; 1)
        return std::integral_constant&lt;int, Fibnacci&lt;n - 1&gt;() + Fibnacci&lt;n - 2&gt;()&gt;{};
    else
        return std::integral_constant&lt;int, n&gt;{};
}
</pre>
</div>
</div>
</div>


<div id="outline-container-org2d37781" class="outline-2">
<h2 id="org2d37781"><span class="section-number-2">8.</span> SFINAE</h2>
<div class="outline-text-2" id="text-8">
<p>
<a href="https://zh.cppreference.com/w/cpp/language/function_template">https://zh.cppreference.com/w/cpp/language/function_template</a>
</p>

<p>
编译器 <b><b>模版实例化</b></b> 的步骤:
</p>
<ol class="org-ol">
<li>模板实参推导：
<ol class="org-ol">
<li>如果已经提供了模版参数，则原封不动获得。</li>
<li>（否则）从函数调用时的函数参数进行 <b><b>type deduction</b></b> 推断获得。
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=wQxj20X-tIU">https://www.youtube.com/watch?v=wQxj20X-tIU</a></li>
</ul></li>
<li>（否则）从模版声明的 <b><b>默认模版参数</b></b> 获得。</li>
</ol></li>
<li>模板实参替换，替换失败时会从重载集中移除（而非引发编译错误）。
<ul class="org-ul">
<li>SFINAE <a href="https://zh.cppreference.com/w/cpp/language/sfinae">https://zh.cppreference.com/w/cpp/language/sfinae</a></li>
</ul></li>
<li>重载决议。</li>
</ol>
</div>
</div>


<div id="outline-container-org71285dd" class="outline-2">
<h2 id="org71285dd"><span class="section-number-2">9.</span> enable_if</h2>
<div class="outline-text-2" id="text-9">
<p>
当 B 为 true 的时候，有关联类型 type = T。
为 false 的时候无 type 定义，可触发谬构和 SFINAE。
</p>

<div class="org-src-container">
<pre class="src src-c++">template&lt;bool B, class T = void&gt;
struct enable_if {};

template&lt;class T&gt;
struct enable_if&lt;true, T&gt; { typedef T type; };
</pre>
</div>

<p>
四种用法例子：
</p>
<div class="org-src-container">
<pre class="src src-c++">int func(...) { return 0; }
int func(float f) { return 2; }

template &lt;typename T&gt;
std::enable_if_t&lt;std::is_integral_v&lt;T&gt;, int&gt; func(T) { return 1; }

// template &lt;typename T&gt;
// int func(T, std::enable_if_t&lt;std::is_integral_v&lt;T&gt;, int&gt; = 0) { return 1; }

// template &lt;typename T, typename = std::enable_if_t&lt;std::is_integral_v&lt;T&gt;&gt;&gt;
// int func(T) { return 1; }

// template &lt;typename T, std::enable_if_t&lt;std::is_integral_v&lt;T&gt;, int&gt; = 0&gt;
// int func(T) { return 1; }

std::cout &lt;&lt; func(nullptr) &lt;&lt; " " &lt;&lt; func(2) &lt;&lt; " " &lt;&lt; func(2.f);  // 0 1 2
</pre>
</div>

<p>
注意：仅默认模板实参不同 (<code>typename = std::enable_if_t&lt;...&gt;</code>) 只会当做同一函数模板的再声明。
</p>
</div>
</div>


<div id="outline-container-org530b90e" class="outline-2">
<h2 id="org530b90e"><span class="section-number-2">10.</span> integer_sequence (C++14)</h2>
<div class="outline-text-2" id="text-10">
<p>
常用 <code>index_sequence</code> 为 <code>T = size_t</code> 的特化。
</p>

<p>
出现在函数参数中时，为模版参数引入形参包 ，以便配合 <code>std::get</code> 展开。
</p>

<div class="org-src-container">
<pre class="src src-c++">template &lt;size_t ...N&gt;
struct index_sequence {};

template &lt;size_t N, size_t ...M&gt;
struct make_index_sequence : index_sequence&lt;N - 1, N - 1, M...&gt; {};

template &lt;size_t ...M&gt;
struct make_index_sequence&lt;0, M...&gt; : index_sequence&lt;M...&gt; {};

template&lt;typename ...Ts&gt;
using index_sequence_for = make_index_sequence&lt;sizeof...(Ts)&gt;;
</pre>
</div>

<p>
实用例子：
</p>
<div class="org-src-container">
<pre class="src src-c++">template &lt;typename... Queue&gt;
struct MultiQueueLock {
  MultiQueueLock(Queue... lockable) : tuple_{lockable...} { lock(); }
  ~MultiQueueLock() { unlock(); }
  void lock() { lock_impl(typename std::index_sequence_for&lt;Queue...&gt;{}); }
  void unlock() { unlock_impl(typename std::index_sequence_for&lt;Queue...&gt;{}); }
 private:
  template &lt;size_t... Is&gt;
  void lock_impl(std::index_sequence&lt;Is...&gt;) {
    std::lock(std::get&lt;Is&gt;(tuple_)-&gt;mutex...);
  }
  template &lt;size_t... Is&gt;
  void unlock_impl(std::index_sequence&lt;Is...&gt;) {
    std::initializer_list&lt;void&gt;{std::get&lt;Is&gt;(tuple_)-&gt;mutex.unlock()...};
    // (std::get&lt;Is&gt;(tuple_)-&gt;mutex.unlock()...);  // C++17 fold expressions
  }
  std::tuple&lt;Queue...&gt; tuple_;
};
</pre>
</div>
</div>
</div>


<div id="outline-container-org85aba64" class="outline-2">
<h2 id="org85aba64"><span class="section-number-2">11.</span> void_t (C++17)</h2>
<div class="outline-text-2" id="text-11">
<p>
(since 2014 from Dr. Brown) <a href="https://www.youtube.com/watch?v=a0FliKwcwXE">https://www.youtube.com/watch?v=a0FliKwcwXE</a>
</p>

<div class="org-src-container">
<pre class="src src-c++">template&lt;typename...&gt;
using void_t = void;  // pure/direct alias template
</pre>
</div>

<p>
用于检测 SFINAE 语境中的非良构类型：
</p>
<div class="org-src-container">
<pre class="src src-c++">template&lt;class, class = void&gt;
struct has_type_member : std::false_type { };

template&lt;class T&gt;
struct has_type_member&lt;T, std::void_t&lt;typename T::type&gt;&gt; : std::true_type { };
</pre>
</div>

<p>
注意： <code>typename = void</code> 是必要的，否则 <code>void_t</code> 版本不能覆盖默认生成的 specialization。
</p>

<p>
用来检测表达式的合法性：
</p>
<div class="org-src-container">
<pre class="src src-c++">template&lt; class, class = void &gt;
struct has_pre_increment_member : std::false_type { };

template&lt; class T &gt;
struct has_pre_increment_member&lt;T, std::void_t&lt;decltype(++std::declval&lt;T&amp;&gt;())&gt;&gt; : std::true_type { };
</pre>
</div>

<p>
用来实现 <code>is_assignable</code> 的例子：
</p>
<div class="org-src-container">
<pre class="src src-c++">template&lt;typename T, typename U, typename = void&gt;
struct is_assignable: std::false_type {};

template&lt;typename T, typename U&gt;
struct is_assignable&lt;T, U, std::void_t&lt;decltype(std::declval&lt;T&gt;() = std::declval&lt;U&gt;())&gt;&gt;: std::true_type {};
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: scturtle</p>
<p class="date">Created: 2023-06-14 Wed 17:59</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>